## Pandas 학습

### 라이브러리 추가
```python
> !pip install pandas
```

- Succeddfullt Installed... : 최초 설치
- Requorement already satisfied... : 이미 설치됨

### 자료구조
#### 데이터 프레임

In [18]:
!pip install pandas

Requirement already satisfied: pandas in c:\dev\python312\lib\site-packages (2.2.1)
Requirement already satisfied: numpy<2,>=1.26.0 in c:\dev\python312\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\administrator\appdata\roaming\python\python312\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\dev\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\dev\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\administrator\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

### 판다스 라이브러리 로딩
``` python
import pandas as pd
```

In [19]:
import pandas as pd

### 판다스 기본
#### DataFrame 객체
- 파이썬 2차원 리스트(배열)와 동일
- 행(row) 각 하나의 유니크 데이터 묶음
- 열(colum) 유니크 데이터의 하나하나 특성

In [20]:
## 딕셔너리로 DataFrame 객체 생성
data = {'이름': ['이도현','티모시','릴리'], '나이': [30, 20, 25], '결혼': [False,True,False]}
df = pd.DataFrame(data=data)
df

    이름  나이     결혼
0  이도현  30  False
1  티모시  20   True
2   릴리  25  False

In [21]:
## 2차원 리스트 생성
data = [['홍길동', 20, '부산', 'hong@email.com',True],['장보고',30,'서울','jang@email.com', False],
        ['강감찬', 10, '대구', 'kang@email.com',True],['이도현',40, '서울','Lee@email.com', False]]
data

[['홍길동', 20, '부산', 'hong@email.com', True],
 ['장보고', 30, '서울', 'jang@email.com', False],
 ['강감찬', 10, '대구', 'kang@email.com', True],
 ['이도현', 40, '서울', 'Lee@email.com', False]]

In [22]:
## 2차원 리스트로 DataFrame 객체 생성
df = pd.DataFrame(data=data, columns=['이름','나이', '거주지', '이메일','결혼'])
df

    이름  나이 거주지             이메일     결혼
0  홍길동  20  부산  hong@email.com   True
1  장보고  30  서울  jang@email.com  False
2  강감찬  10  대구  kang@email.com   True
3  이도현  40  서울   Lee@email.com  False

In [23]:
## DataFrame에서 데이터 조회(열) - 리스트는 for문을 써야지 출력가능
df['이름']

0    홍길동
1    장보고
2    강감찬
3    이도현
Name: 이름, dtype: object

In [24]:
## DataFrame 조회(두개 열)
df[['이름','나이']]

    이름  나이
0  홍길동  20
1  장보고  30
2  강감찬  10
3  이도현  40

In [25]:
## 데이터프레임 행으로 조회
df.loc[0]

이름                홍길동
나이                 20
거주지                부산
이메일    hong@email.com
결혼               True
Name: 0, dtype: object

In [26]:
## 데이터프레임 조회[행]
df.loc[[1, 3]]

    이름  나이 거주지             이메일     결혼
1  장보고  30  서울  jang@email.com  False
3  이도현  40  서울   Lee@email.com  False

In [27]:
## 현재 데이터프레임 확인
df

    이름  나이 거주지             이메일     결혼
0  홍길동  20  부산  hong@email.com   True
1  장보고  30  서울  jang@email.com  False
2  강감찬  10  대구  kang@email.com   True
3  이도현  40  서울   Lee@email.com  False

In [47]:
## 새 컬럼 추가
df['번호'] = ['010', '011', '017', '019']

In [48]:
## 추가된 데이터프레임 확인
df

    이름  나이 거주지             이메일     결혼   번호
0  홍길동  20  부산  hong@email.com   True  010
1  장보고  30  서울  jang@email.com  False  011
2  강감찬  10  대구  kang@email.com   True  017
3  이도현  40  서울   Lee@email.com  False  019

In [50]:
## 열 삭제, axis = 0(행) axis = 1(열)
df.drop('결혼', axis=1)

    이름  나이 거주지             이메일   번호
0  홍길동  20  부산  hong@email.com  010
1  장보고  30  서울  jang@email.com  011
2  강감찬  10  대구  kang@email.com  017
3  이도현  40  서울   Lee@email.com  019

In [51]:
## 삭제를 확인
df

    이름  나이 거주지             이메일     결혼   번호
0  홍길동  20  부산  hong@email.com   True  010
1  장보고  30  서울  jang@email.com  False  011
2  강감찬  10  대구  kang@email.com   True  017
3  이도현  40  서울   Lee@email.com  False  019

In [ ]:
## drop()은 삭제하고 출력해줌. 완전히 삭제하려면 inplace 옵션을 사용
df.drop('결혼', axis=1, inplace=True) # 열로 삭제하려면  axis를 1만 사용

In [55]:
## 완전히 삭제를 확인
df

    이름  나이 거주지             이메일   번호
0  홍길동  20  부산  hong@email.com  010
1  장보고  30  서울  jang@email.com  011
2  강감찬  10  대구  kang@email.com  017
3  이도현  40  서울   Lee@email.com  019

In [58]:
## 행추가
df.loc[4] = ['김고은', '32', '서울', 'kim@email.com', '020']

In [60]:
df

    이름  나이 거주지             이메일   번호
0  홍길동  20  부산  hong@email.com  010
1  장보고  30  서울  jang@email.com  011
2  강감찬  10  대구  kang@email.com  017
3  이도현  40  서울   Lee@email.com  019
4  김고은  32  서울   kim@email.com  020

In [64]:
## 행삭제, 완전히 삭제할려면 inplace 사용 또는 변수에 재할당
df2 = df.drop(3)

In [65]:
df2

    이름  나이 거주지             이메일   번호
0  홍길동  20  부산  hong@email.com  010
1  장보고  30  서울  jang@email.com  011
2  강감찬  10  대구  kang@email.com  017
4  김고은  32  서울   kim@email.com  020

In [68]:
## 행삭제 inplace, 행으로 삭제하려면  axis를 0만 사용 또는 생략
df.drop(3, axis=0, inplace=True)

In [70]:
df

    이름  나이 거주지             이메일   번호
0  홍길동  20  부산  hong@email.com  010
1  장보고  30  서울  jang@email.com  011
4  김고은  32  서울   kim@email.com  020

In [72]:
# 열 이름을 변경
df.rename(columns={'번호':'휴대폰'}, inplace=True)

In [73]:
df

    이름  나이 거주지             이메일  휴대폰
0  홍길동  20  부산  hong@email.com  010
1  장보고  30  서울  jang@email.com  011
4  김고은  32  서울   kim@email.com  020

- 데이터프레임은 파이썬의 2차원 리스트와 동일하지만, 좀 더 사용하기 쉽도록 만든 클래스

### 시리즈 객체

- 파이썬에서 1차원 리스트(배열)
- 시리즈들 그루핑한게 데이터프레임
- 가장 최소단위

In [75]:
data = [47, 20, 40, 18, 32]
srs = pd.Series(data=data)
srs

0    47
1    20
2    40
3    18
4    32
dtype: int64

In [77]:
## 데이터프레임의 한 열을 가지고 온 자료구조와 시리즈는 동일
type(df['나이'])

pandas.core.series.Series

In [79]:
type(srs)

pandas.core.series.Series

In [84]:
srs = pd.Series(data=data, index=['강도원','김남길','최우식','이도현','김고은'])
srs

강도원    47
김남길    20
최우식    40
이도현    18
김고은    32
dtype: int64

In [86]:
## 조회
srs['이도현']

18

In [87]:
## 값변경
srs['김고은'] = 56

In [89]:
srs

강도원    47
김남길    20
최우식    40
이도현    18
김고은    56
dtype: int64

In [91]:
## 데이터프레임에서 한 행을 가져와도 시리즈
df.loc[1]

이름                장보고
나이                 30
거주지                서울
이메일    jang@email.com
휴대폰               011
Name: 1, dtype: object

### 데이터프레임 사용하기

- CSV, 엑셀파일 로드
- VS Code 플러그인(확장), GrapeCity의 Excel Viewer 설치

In [97]:
df_csv = pd.read_csv('./data/sample_1.csv', encoding='utf-8')
df_csv

  2019년 11월 입국객 수 Unnamed: 1 Unnamed: 2 Unnamed: 3
0            국적코드         성별       입국객수       전년동기
1             A01         남성     106320      85815
2             A01         여성     191436     125241
3             A31         남성        319        299
4             A31         여성         42         54
5             A18         남성     158912     124486
6             A18         여성     232943     163466
7           총 합계      689972        NaN        NaN
8            전년동기     499361        NaN        NaN